Repository: Michaelzag/picklizer_app
Catalog: lib/l10n/app_*.arb
Languages: ar, fil, hi, ko, ms, th, vi, zh

source: Live View
ar: العرض المباشر
fil: Live na Tingin
hi: लाइव व्यू
ko: 라이브 뷰
ms: Paparan Langsung
th: ดูสด
vi: Xem Trực Tiếp
zh: 实时视图

source: Queue
ar: الطابور
fil: Pila
hi: कतार
ko: 대기열
ms: Barisan
th: คิว
vi: Hàng Đợi
zh: 队列

source: Facilities
ar: المرافق
fil: Mga Pasilidad
hi: सुविधाएं
ko: 시설
ms: Kemudahan
th: สิ่งอำนวยความสะดวก
vi: Cơ Sở
zh: 场馆

source: Players
ar: اللاعبون
fil: Mga Manlalaro
hi: खिलाड़ी
ko: 플레이어
ms: Pemain
th: ผู้เล่น
vi: Người Chơi
zh: 球员

source: Sessions
ar: الجلسات
fil: Mga Sesyon
hi: सत्र
ko: 세션
ms: Sesi
th: เซสชัน
vi: Phiên
zh: 会话

source: Settings
ar: الإعدادات
fil: Mga Setting
hi: सेटिंग्स
ko: 설정
ms: Tetapan
th: การตั้งค่า
vi: Cài Đặt
zh: 设置

source: Language
ar: اللغة
fil: Wika
hi: भाषा
ko: 언어
ms: Bahasa
th: ภาษา
vi: Ngôn Ngữ
zh: 语言

source: Create Facility
ar: إنشاء مرفق
fil: Gumawa ng Pasilidad
hi: सुविधा बनाएं
ko: 시설 생성
ms: Cipta Kemudahan
th: สร้างสถานที่
vi: Tạo Cơ Sở
zh: 创建场馆

source: Add Court
ar: إضافة ملعب
fil: Magdagdag ng Court
hi: कोर्ट जोड़ें
ko: 코트 추가
ms: Tambah Gelanggang
th: เพิ่มสนาม
vi: Thêm Sân
zh: 添加球场

source: Add Player
ar: إضافة لاعب
fil: Magdagdag ng Manlalaro
hi: खिलाड़ी जोड़ें
ko: 플레이어 추가
ms: Tambah Pemain
th: เพิ่มผู้เล่น
vi: Thêm Người Chơi
zh: 添加球员

source: Create Session
ar: إنشاء جلسة
fil: Gumawa ng Sesyon
hi: सत्र बनाएं
ko: 세션 생성
ms: Cipta Sesi
th: สร้างเซสชัน
vi: Tạo Phiên
zh: 创建会话

source: Facility Name
ar: اسم المرفق
fil: Pangalan ng Pasilidad
hi: सुविधा का नाम
ko: 시설 이름
ms: Nama Kemudahan
th: ชื่อสถานที่
vi: Tên Cơ Sở
zh: 场馆名称

source: Location
ar: الموقع
fil: Lokasyon
hi: स्थान
ko: 위치
ms: Lokasi
th: ตำแหน่ง
vi: Vị Trí
zh: 位置

source: Player Name
ar: اسم اللاعب
fil: Pangalan ng Manlalaro
hi: खिलाड़ी का नाम
ko: 플레이어 이름
ms: Nama Pemain
th: ชื่อผู้เล่น
vi: Tên Người Chơi
zh: 球员姓名

source: Singles
ar: فردي
hi: एकल
ko: 단식
ms: Perseorangan
th: เดี่ยว
vi: Đơn
zh: 单打

source: Doubles
ar: زوجي
hi: युगल
ko: 복식
ms: Beregu
th: คู่
vi: Đôi
zh: 双打

source: King of Hill
ar: ملك التل
fil: Hari ng Burol
hi: पहाड़ी का राजा
ko: 킹 오브 힐
ms: Raja Bukit
th: ราชาแห่งเนิน
vi: Vua Đồi
zh: 山丘之王

source: Round Robin
ar: الدوري الدائري
hi: राउंड रॉबिन
ko: 라운드 로빈
ms: Pusingan Robin
th: รอบโรบิน
vi: Vòng Tròn
zh: 循环赛

source: Save
ar: حفظ
fil: I-save
hi: सेव करें
ko: 저장
ms: Simpan
th: บันทึก
vi: Lưu
zh: 保存

source: Cancel
ar: إلغاء
fil: Kanselahin
hi: रद्द करें
ko: 취소
ms: Batal
th: ยกเลิก
vi: Hủy
zh: 取消

source: Delete
ar: حذف
fil: Tanggalin
hi: हटाएं
ko: 삭제
ms: Padam
th: ลบ
vi: Xóa
zh: 删除

source: Edit
ar: تعديل
fil: I-edit
hi: संपादित करें
ko: 편집
th: แก้ไข
vi: Chỉnh Sửa
zh: 编辑

source: Next
ar: التالي
fil: Susunod
hi: अगला
ko: 다음
ms: Seterusnya
th: ถัดไป
vi: Tiếp Theo
zh: 下一步

source: Previous
ar: السابق
fil: Nakaraan
hi: पिछला
ko: 이전
ms: Sebelumnya
th: ก่อนหน้า
vi: Trước
zh: 上一步

source: Setup Walkthrough
ar: دليل الإعداد
fil: Gabay sa Pag-setup
hi: सेटअप गाइड
ko: 설정 가이드
ms: Panduan Persediaan
th: คู่มือการตั้งค่า
vi: Hướng Dẫn Thiết Lập
zh: 设置向导

# stepXOfY
source: Step {step} of {total}
ar: الخطوة {step} من {total}
fil: Hakbang {step} ng {total}
hi: चरण {step} का {total}
ko: {total} 중 {step}단계
ms: Langkah {step} daripada {total}
th: ขั้นตอน {step} จาก {total}
vi: Bước {step} của {total}
zh: 第 {step} 步，共 {total} 步

source: No location
ar: لا يوجد موقع
fil: Walang lokasyon
hi: कोई स्थान नहीं
ko: 위치 없음
ms: Tiada lokasi
th: ไม่มีตำแหน่ง
vi: Không có vị trí
zh: 无位置

# courtCount
source: {count} Court
ar: {count} ملعب
hi: {count} कोर्ट
ko: {count}개 코트
ms: {count} Gelanggang
th: {count} สนาม
vi: {count} Sân
zh: {count} 个球场

# courtsCount
source: {count} Courts
ar: {count} ملاعب
fil: {count} mga Court
hi: {count} कोर्ट
ko: {count}개 코트
ms: {count} Gelanggang
th: {count} สนาม
vi: {count} Sân
zh: {count} 个球场

# playerCount
source: {count} Player
ar: {count} لاعب
fil: {count} Manlalaro
hi: {count} खिलाड़ी
ko: {count}명 플레이어
ms: {count} Pemain
th: {count} ผู้เล่น
vi: {count} Người Chơi
zh: {count} 名球员

# playersCount
source: {count} Players
ar: {count} لاعبين
fil: {count} mga Manlalaro
hi: {count} खिलाड़ी
ko: {count}명 플레이어
ms: {count} Pemain
th: {count} ผู้เล่น
vi: {count} Người Chơi
zh: {count} 名球员

# morePlayersIndicator
source: +{count} more
ar: +{count} آخرين
fil: +{count} pa
hi: +{count} और
ko: +{count}명 더
ms: +{count} lagi
th: +{count} เพิ่มเติม
vi: +{count} thêm
zh: +{count} 更多

source: Session Active
ar: الجلسة نشطة
fil: Aktibong Sesyon
hi: सत्र सक्रिय
ko: 세션 활성
ms: Sesi Aktif
th: เซสชันใช้งานอยู่
vi: Phiên Đang Hoạt Động
zh: 会话活跃

# startedAt
source: Started at {time}
ar: بدأت في {time}
fil: Nagsimula sa {time}
hi: {time} पर शुरू हुआ
ko: {time}에 시작됨
ms: Dimulakan pada {time}
th: เริ่มเมื่อ {time}
vi: Bắt đầu lúc {time}
zh: 开始于 {time}

source: Create Your Facility
ar: أنشئ مرفقك
fil: Gumawa ng Inyong Pasilidad
hi: अपनी सुविधा बनाएं
ko: 시설 만들기
ms: Cipta Kemudahan Anda
th: สร้างสถานที่ของคุณ
vi: Tạo Cơ Sở Của Bạn
zh: 创建您的场馆

# facilityDescription
source: A facility represents the location where you play pickleball.
ar: المرفق يمثل المكان الذي تلعب فيه البيكل بول.
fil: Ang pasilidad ay kumakatawan sa lugar kung saan kayo naglalaro ng pickleball.
hi: एक सुविधा उस स्थान का प्रतिनिधित्व करती है जहाँ आप पिकलबॉल खेलते हैं।
ko: 시설은 피클볼을 플레이하는 장소를 나타냅니다.
ms: Kemudahan mewakili lokasi di mana anda bermain pickleball.
th: สถานที่แสดงถึงสถานที่ที่คุณเล่นพิคเคิลบอล
vi: Cơ sở đại diện cho nơi bạn chơi pickleball.
zh: 场馆代表您打匹克球的地点。

source: Setup Courts
ar: إعداد الملاعب
fil: I-setup ang mga Court
hi: कोर्ट सेटअप करें
ko: 코트 설정
ms: Sediakan Gelanggang
th: ตั้งค่าสนาม
vi: Thiết Lập Sân
zh: 设置球场

# courtsDescription
source: Add at least one court to {facilityName}.
ar: أضف ملعباً واحداً على الأقل إلى {facilityName}.
fil: Magdagdag ng hindi bababa sa isang court sa {facilityName}.
hi: {facilityName} में कम से कम एक कोर्ट जोड़ें।
ko: {facilityName}에 최소 하나의 코트를 추가하세요.
ms: Tambah sekurang-kurangnya satu gelanggang ke {facilityName}.
th: เพิ่มอย่างน้อยหนึ่งสนามให้กับ {facilityName}
vi: Thêm ít nhất một sân vào {facilityName}.
zh: 为 {facilityName} 添加至少一个球场。

source: Add Players
ar: إضافة اللاعبين
fil: Magdagdag ng mga Manlalaro
hi: खिलाड़ी जोड़ें
ko: 플레이어 추가
ms: Tambah Pemain
th: เพิ่มผู้เล่น
vi: Thêm Người Chơi
zh: 添加球员

# playersDescription
source: Add at least 2 players to start playing.
ar: أضف لاعبين على الأقل لبدء اللعب.
fil: Magdagdag ng hindi bababa sa 2 manlalaro para magsimula ng laro.
hi: खेलना शुरू करने के लिए कम से कम 2 खिलाड़ी जोड़ें।
ko: 플레이를 시작하려면 최소 2명의 플레이어를 추가하세요.
ms: Tambah sekurang-kurangnya 2 pemain untuk mula bermain.
th: เพิ่มผู้เล่นอย่างน้อย 2 คนเพื่อเริ่มเล่น
vi: Thêm ít nhất 2 người chơi để bắt đầu chơi.
zh: 添加至少 2 名球员开始游戏。

source: Start Your Session
ar: ابدأ جلستك
fil: Simulan ang Inyong Sesyon
hi: अपना सत्र शुरू करें
ko: 세션 시작
ms: Mulakan Sesi Anda
th: เริ่มเซสชันของคุณ
vi: Bắt Đầu Phiên Của Bạn
zh: 开始您的会话

# sessionDescription
source: Ready to start playing at {facilityName} with {playerCount} players and {courtCount} court{courtPlural}.
ar: جاهز لبدء اللعب في {facilityName} مع {playerCount} لاعبين و {courtCount} ملعب{courtPlural}.
fil: Handa na para magsimula ng laro sa {facilityName} na may {playerCount} manlalaro at {courtCount} court{courtPlural}.
hi: {facilityName} में {playerCount} खिलाड़ियों और {courtCount} कोर्ट{courtPlural} के साथ खेलना शुरू करने के लिए तैयार।
ko: {facilityName}에서 {playerCount}명의 플레이어와 {courtCount}개의 코트{courtPlural}로 플레이할 준비가 되었습니다.
ms: Bersedia untuk mula bermain di {facilityName} dengan {playerCount} pemain dan {courtCount} gelanggang{courtPlural}.
th: พร้อมที่จะเริ่มเล่นที่ {facilityName} กับผู้เล่น {playerCount} คนและ {courtCount} สนาม{courtPlural}
vi: Sẵn sàng bắt đầu chơi tại {facilityName} với {playerCount} người chơi và {courtCount} sân{courtPlural}.
zh: 准备在 {facilityName} 开始游戏，有 {playerCount} 名球员和 {courtCount} 个球场{courtPlural}。

source: Start Session
ar: بدء الجلسة
fil: Simulan ang Sesyon
hi: सत्र शुरू करें
ko: 세션 시작
ms: Mulakan Sesi
th: เริ่มเซสชัน
vi: Bắt Đầu Phiên
zh: 开始会话

source: All Set!
ar: كل شيء جاهز!
fil: Handa na Lahat!
hi: सब तैयार!
ko: 모든 준비 완료!
ms: Semua Sedia!
th: พร้อมแล้ว!
vi: Đã Sẵn Sàng!
zh: 全部设置完成！

# completedDescription
source: Your session is active and ready for play. Players can now join the queue.
ar: جلستك نشطة وجاهزة للعب. يمكن للاعبين الآن الانضمام إلى الطابور.
fil: Ang inyong sesyon ay aktibo na at handa para sa laro. Maaari na ngayong sumali ang mga manlalaro sa pila.
hi: आपका सत्र सक्रिय है और खेलने के लिए तैयार है। खिलाड़ी अब कतार में शामिल हो सकते हैं।
ko: 세션이 활성화되어 플레이할 준비가 되었습니다. 플레이어들이 이제 대기열에 참여할 수 있습니다.
ms: Sesi anda aktif dan sedia untuk bermain. Pemain kini boleh menyertai barisan.
th: เซสชันของคุณใช้งานอยู่และพร้อมสำหรับการเล่น ผู้เล่นสามารถเข้าร่วมคิวได้แล้ว
vi: Phiên của bạn đang hoạt động và sẵn sàng để chơi. Người chơi giờ có thể tham gia hàng đợi.
zh: 您的会话已激活并准备游戏。球员现在可以加入队列。

source: Go to Live View
ar: الذهاب إلى العرض المباشر
fil: Pumunta sa Live na Tingin
hi: लाइव व्यू पर जाएं
ko: 라이브 뷰로 이동
ms: Pergi ke Paparan Langsung
th: ไปที่มุมมองสด
vi: Đi Đến Xem Trực Tiếp
zh: 转到实时视图

source: Error loading courts
ar: خطأ في تحميل الملاعب
fil: May error sa pag-load ng mga court
hi: कोर्ट लोड करने में त्रुटि
ko: 코트 로딩 오류
ms: Ralat memuatkan gelanggang
th: เกิดข้อผิดพลาดในการโหลดสนาม
vi: Lỗi tải sân
zh: 加载球场时出错

# needAtLeastTwoPlayers
source: Need at least 2 players to start a session
ar: يحتاج إلى لاعبين على الأقل لبدء الجلسة
fil: Kailangan ng hindi bababa sa 2 manlalaro para magsimula ng sesyon
hi: सत्र शुरू करने के लिए कम से कम 2 खिलाड़ियों की आवश्यकता है
ko: 세션을 시작하려면 최소 2명의 플레이어가 필요합니다
ms: Memerlukan sekurang-kurangnya 2 pemain untuk memulakan sesi
th: ต้องมีผู้เล่นอย่างน้อย 2 คนเพื่อเริ่มเซสชัน
vi: Cần ít nhất 2 người chơi để bắt đầu phiên
zh: 需要至少 2 名球员才能开始会话

source: Session started successfully!
ar: تم بدء الجلسة بنجاح!
fil: Matagumpay na nagsimula ang sesyon!
hi: सत्र सफलतापूर्वक शुरू हुआ!
ko: 세션이 성공적으로 시작되었습니다!
ms: Sesi dimulakan dengan jayanya!
th: เริ่มเซสชันสำเร็จ!
vi: Phiên đã bắt đầu thành công!
zh: 会话启动成功！

# errorStartingSession
source: Error starting session: {error}
ar: خطأ في بدء الجلسة: {error}
fil: May error sa pagsisimula ng sesyon: {error}
hi: सत्र शुरू करने में त्रुटि: {error}
ko: 세션 시작 오류: {error}
ms: Ralat memulakan sesi: {error}
th: เกิดข้อผิดพลาดในการเริ่มเซสชัน: {error}
vi: Lỗi bắt đầu phiên: {error}
zh: 启动会话时出错：{error}
